In [26]:
# axis = 0 , row
# axis = 1 , column
import pandas as pd
#create series
data = pd.Series([10,20,30,40])
print(data)

0    10
1    20
2    30
3    40
dtype: int64

In [27]:
data = pd.Series(['10', 20, 30,40], index=['a', 'b', 'c','d'])
print(data)

a    10
b    20
c    30
d    40
dtype: object

In [28]:
#create a dataframe
data = {
    'Name' : ['John' , 'Anna' , 'Peter' , 'Linda'],
    'Age' : [28,24,35,32],
    'City' : ['New York' , 'Paris' , 'Berlin' , 'London']
}
print(data)
df = pd.DataFrame(data)
print(df)

{'Name': ['John', 'Anna', 'Peter', 'Linda'], 'Age': [28, 24, 35, 32], 'City': ['New York', 'Paris', 'Berlin', 'London']}
    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [29]:
#DataFrame Operations
#1. Viewing Data

print(df.head())    #First 5 rows
print(df.tail())    #Last 5 rows
print(df.info())    #Summary of Data frame

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London
    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Name    4 non-null object
Age     4 non-null int64
City    4 non-null object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes
None

In [30]:
print(df.describe())

             Age
count   4.000000
mean   29.750000
std     4.787136
min    24.000000
25%    27.000000
50%    30.000000
75%    32.750000
max    35.000000

In [31]:
#2. Indexing and Selection

#Select a cloumn
print(df['Name'])

#Select rows by index
print(df.loc[0])         #Select row with index 0

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object
Name        John
Age           28
City    New York
Name: 0, dtype: object

In [32]:
#select rows by condition
print(df[df['Age']>30])

    Name  Age    City
2  Peter   35  Berlin
3  Linda   32  London

In [33]:
#select multiple columns
print(df[['Name' , 'Age']])

    Name  Age
0   John   28
1   Anna   24
2  Peter   35
3  Linda   32

In [34]:
#seect row by index position
print(df.iloc[0])              #First row
print(df.iloc[1:3])            # Second to third rows

Name        John
Age           28
City    New York
Name: 0, dtype: object
    Name  Age    City
1   Anna   24   Paris
2  Peter   35  Berlin

In [35]:
#3. Data mamipulation
# Add a new column
df['Country'] = 'USA'
df

    Name  Age      City Country
0   John   28  New York     USA
1   Anna   24     Paris     USA
2  Peter   35    Berlin     USA
3  Linda   32    London     USA

In [36]:
#Drop a column
df = df.drop('Country', axis=1)
df

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [37]:
#Rename columns
df = df.rename(columns = {'Name' : 'Full Name'})
df

  Full Name  Age      City
0      John   28  New York
1      Anna   24     Paris
2     Peter   35    Berlin
3     Linda   32    London

In [38]:
#Filter rows
df_filtered = df[df['Age'] >25]
df_filtered

  Full Name  Age      City
0      John   28  New York
2     Peter   35    Berlin
3     Linda   32    London

In [39]:
#Sort data
df_sorted = df.sort_values(by='Age', ascending = False)
df_sorted

  Full Name  Age      City
2     Peter   35    Berlin
3     Linda   32    London
0      John   28  New York
1      Anna   24     Paris

In [40]:
import pandas as pd
#define a dictionary containing student data
data = {'Name'}